Revit 2026 API

# STLImportOptions(STLImportOptions) Constructor

---

Constructs a new instance of STLImportOptions as a copy of the import options.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public STLImportOptions(
	STLImportOptions option
)
```
```vb
Public Sub New (
	option As STLImportOptions
)
```
```cpp
public:
STLImportOptions(
	STLImportOptions^ option
)
```
```fsharp
new :
        option : STLImportOptions -> STLImportOptions
```

#### Parameters

option STLImportOptions
     The STL options to be copied.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

STLImportOptions Class

STLImportOptions Overload

Autodesk.Revit.DB Namespace